## Staging: newrelic
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                           |
|--------|----------------------------------------------------------|
| add    | `aws_cloudwatch_metric_stream.newrelic_metric_stream[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_stream.newrelic_metric_stream[0] will be created
  + resource "aws_cloudwatch_metric_stream" "newrelic_metric_stream" {
      + arn              = (known after apply)
      + creation_date    = (known after apply)
      + firehose_arn     = "arn:aws:firehose:ca-central-1:239043911459:deliverystream/newrelic_firehose_stream_staging"
      + id               = (known after apply)
      + last_update_date = (known after apply)
      + name             = "newrelic-metric-stream-staging"
      + name_prefix      = (known after apply)
      + output_format    = "opentelemetry0.7"
      + role_arn         = "arn:aws:iam::239043911459:role/newrelic_metric_stream_to_firehose_role_staging"
      + state            = (known after apply)
      + tags_all         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

